# RoutingPreferenceRule Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoutingPreferenceRule Class
Members See Also
---
A class representing a rule set in MEP routing preferences.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class RoutingPreferenceRule : IDisposable
```

Visual Basic
---
```text
Public Class RoutingPreferenceRule _
	Implements IDisposable
```

Visual C++
---
```text
public ref class RoutingPreferenceRule : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..RoutingPreferenceRule
# See Also
RoutingPreferenceRule Members
Autodesk.Revit.DB Namespace